#### Terraform Plan - production

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.images will be created
  + resource "google_artifact_registry_repository" "images" {
      + create_time      = (known after apply)
      + description      = "Docker images for The Curated Knot"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-south1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "curated-knot-prod"
      + repository_id    = "curated-knot-images"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_project_service.apis["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.apis["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "cloudbuild.googleapis.com"
    }

  # google_project_service.apis["iam.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.apis["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.apis["run.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "run.googleapis.com"
    }

  # google_project_service.apis["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "secretmanager.googleapis.com"
    }

  # google_project_service.apis["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "sqladmin.googleapis.com"
    }

  # google_project_service.apis["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "curated-knot-prod"
      + service            = "vpcaccess.googleapis.com"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/cloudsql.client"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/cloudtrace.agent"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/logging.logWriter"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.api_service_account.google_service_account.account will be created
  + resource "google_service_account" "account" {
      + account_id   = "curated-knot-api"
      + disabled     = false
      + display_name = "Curated Knot API Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "curated-knot-prod"
      + unique_id    = (known after apply)
    }

  # module.cloud_run_api.google_cloud_run_service_iam_member.public will be created
  + resource "google_cloud_run_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-south1"
      + member   = "allUsers"
      + project  = "curated-knot-prod"
      + role     = "roles/run.invoker"
      + service  = "curated-knot-api"
    }

  # module.cloud_run_api.google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-south1"
      + name                    = "curated-knot-api"
      + observed_generation     = (known after apply)
      + project                 = "curated-knot-prod"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = (known after apply)
          + timeout                          = "300s"

          + containers {
              + image = "asia-south1-docker.pkg.dev/curated-knot-prod/curated-knot-images/curated-knot-api:main"

              + env {
                  + name  = "NODE_ENV"
                  + value = "production"
                }
              + env {
                  + name  = "ALLOWED_ORIGINS"
                  + value = "https://thecuratedknot.com,https://admin.thecuratedknot.com"
                }
              + env {
                  + name = "CLERK_SECRET_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "clerk-secret-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "DATABASE_URL"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "database-url"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "MONGODB_URI"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "mongodb-uri"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "PRISMA_DATABASE_URL"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "prisma-database-url"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "SENTRY_DSN"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "sentry-dsn"
                          + version = "latest"
                        }
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 1
                  + initial_delay_seconds = 0
                  + period_seconds        = 240
                  + timeout_seconds       = 240

                  + tcp_socket {
                      + port = 8080
                    }
                }

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = (known after apply)
                }
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "ALL_TRAFFIC"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.cloud_sql.google_sql_database_instance.main will be created
  + resource "google_sql_database_instance" "main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "curated-knot-db"
      + private_ip_address             = (known after apply)
      + project                        = "curated-knot-prod"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-south1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + ipv4_enabled   = true
              + server_ca_mode = (known after apply)
              + ssl_mode       = (known after apply)

              + authorized_networks {
                  + value = "34.180.41.227/32"
                }
            }
        }
    }

  # module.github_actions_service_account.google_project_iam_member.roles["roles/artifactregistry.writer"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/artifactregistry.writer"
    }

  # module.github_actions_service_account.google_project_iam_member.roles["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.github_actions_service_account.google_project_iam_member.roles["roles/run.admin"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/run.admin"
    }

  # module.github_actions_service_account.google_project_iam_member.roles["roles/storage.admin"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "curated-knot-prod"
      + role    = "roles/storage.admin"
    }

  # module.github_actions_service_account.google_service_account.account will be created
  + resource "google_service_account" "account" {
      + account_id   = "github-actions"
      + disabled     = false
      + display_name = "GitHub Actions Deployer"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "curated-knot-prod"
      + unique_id    = (known after apply)
    }

  # module.networking.google_compute_address.nat_ip[0] will be created
  + resource "google_compute_address" "nat_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "curated-knot-nat-ip"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "curated-knot-prod"
      + purpose            = (known after apply)
      + region             = "asia-south1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

  # module.networking.google_compute_router.router[0] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "curated-knot-router"
      + network            = "default"
      + project            = "curated-knot-prod"
      + region             = "asia-south1"
      + self_link          = (known after apply)
    }

  # module.networking.google_compute_router_nat.nat[0] will be created
  + resource "google_compute_router_nat" "nat" {
      + auto_network_tier                   = (known after apply)
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + endpoint_types                      = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "curated-knot-nat"
      + nat_ip_allocate_option              = "MANUAL_ONLY"
      + nat_ips                             = (known after apply)
      + project                             = "curated-knot-prod"
      + region                              = "asia-south1"
      + router                              = "curated-knot-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = true
          + filter = "ALL"
        }
    }

  # module.networking.google_vpc_access_connector.connector will be created
  + resource "google_vpc_access_connector" "connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.8.0.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = (known after apply)
      + max_throughput     = 300
      + min_instances      = (known after apply)
      + min_throughput     = 200
      + name               = "vpc-connector"
      + network            = "default"
      + project            = "curated-knot-prod"
      + region             = "asia-south1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

  # module.static_assets.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTH1"
      + name                        = "curated-knot-static-assets"
      + project                     = "curated-knot-prod"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_service_account            = (known after apply)
  + artifact_registry_url          = "asia-south1-docker.pkg.dev/curated-knot-prod/curated-knot-images"
  + cloud_run_url                  = (known after apply)
  + cloud_sql_connection           = (known after apply)
  + cloud_sql_ip                   = (known after apply)
  + github_actions_service_account = (known after apply)
  + nat_ips                        = [
      + (known after apply),
    ]
  + vpc_connector_id               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Triggered by: @abhinavjain-tck, Action: `pull_request`*

> Comment `/apply` to apply this plan.